[
    {
        "week": 1,
        "theme": "Solitude",
        "description": "<h1>Week 1: Solitude</h1><div class='[ text-bigger bold ]'>What is it?</div><p>Solitude is all about finding a quiet, calm spot to spend time with God by yourself. There are two parts to solitude:</p><ol> <li>We remove the noise and chaos of our life, if only for a few minutes.</li> <li>We add in the voice of God, through his word.</li></ol><div class='[ text-bigger bold ]'>Why take this time?</div><p>Our lives are often filled with noise and busyness. We are often on the go and typically multi-tasking. While this isn&rsquo;t all bad, we are made to take a breath and simply slow down. Psalm 46:10 calls us to &ldquo;Be still and know that I am God.&rdquo; There&rsquo;s something very restful and profound that happens when we create a quiet, calm time to be with God. The Psalmist knew its importance for deepening our relationship with God. It&rsquo;s our desire to see you and the church experience the same thing.</p><p>The Psalmist&rsquo;s relationship with God was a deep one. We hope to become more like him as we create space to listen to God more closely, hear his voice more clearly and reflect on Christ more deeply.</p><div class='[ text-bigger bold ]'>How will this work?</div><ol> <li>As close to 7:10 a.m. and 7:10 p.m. as possible, find a quiet place to be by yourself. </li> <li>Have only a Bible and a journal with you. Leave your phones and turn off all music and TV. </li> <li>Be still and quiet for the first half of your time.</li> <li>Read the passage for the day, and write down what God is saying to you from his Word and what impacts you from what you&rsquo;ve read.</li> <li>Close in prayer. <ul> <li><span class='bold'>Monday:</span> <a href='http://www.biblegateway.com/passage/?search=Romans+5%3A6-11%C2%A0&version=ESV' target='_blank'>Romans 5:6-11</a></li> <li><span class='bold'>Tuesday:</span> <a href='http://www.biblegateway.com/passage/?search=1+John+4%3A7-12&version=ESV' target='_blank'>1 John 4:7-12</a></li> <li><span class='bold'>Wednesday:</span> <a href='http://www.biblegateway.com/passage/?search=Matthew+26%3A36-46&version=ESV' target='_blank'>Matthew 26:36-46</a></li> <li><span class='bold'>Thursday:</span> <a href='http://www.biblegateway.com/passage/?search=Matthew+27%3A45-56&version=ESV' target='_blank'>Matthew 27:45-56<a/></li> <li><span class='bold'>Friday:</span> <a href='http://www.biblegateway.com/passage/?search=Philippians+2%3A1-10&version=ESV' target='_blank'>Philippians 2:1-10</a></li> </ul> </li></ol>",
        "startDate": "2017-03-13",
        "endDate": null
    },
    {
        "week": 2,
        "theme": "Scripture Memorization",
        "description": "<h1>Week 2: Scripture Memorization</h1><div class='[ text-bigger bold ]'>What is scripture memorization?</div><p>Scripture memorization is exactly what it sounds like: memorizing the words of certain scripture passages so that the truth moves from your head to your heart and can come out in the way you live your life.</p><div class='[ text-bigger bold ]'>Why memorize scripture?</div><p>Psalm 119:11 says, &ldquo;I have stored up your word in my heart, that I might not sin against you.&rdquo; It&rsquo;s important to guard against this becoming an academic exercise, but instead, it is a way to internalize God&rsquo;s truth. It allows us to think on scripture more frequently and apply it more quickly as it comes to mind.</p><div class='[ text-bigger bold ]'>10 minutes of scripture memorization</div><p>Together, we&rsquo;ll attempt to memorize five scripture passages this week, one each day. Here are the passages and the best way to memorize. For this week, we&rsquo;ll focus on the words of Jesus throughout the gospels. By giving 10 minutes, twice a day you should have these verses memorized.</p><ul> <li><span class='bold'>Monday:</span> <ul> <li>Memorize <a href='https://www.biblegateway.com/passage/?search=Matthew+6%3A33&version=ESV' target='_blank'>Matthew 6:33</a></li> </ul> </li> <li><span class='bold'>Tuesday:</span> <ul> <li>Review Matthew 6:33</li> <li>Memorize <a href='https://www.biblegateway.com/passage/?search=Mark+8%3A34-35&version=ESV' target='_blank'>Mark 8:34-35</a></li> </ul> </li> <li><span class='bold'>Wednesday:</span> <ul> <li>Review Matthew 6:33 and Mark 8:34-35</li> <li>Memorize <a href='https://www.biblegateway.com/passage/?search=Matthew+11%3A28-30&version=ESV' target='_blank'>Matthew 11:28-30</a></li> </ul> </li> <li><span class='bold'>Thursday:</span> <ul> <li>Review Matthew 6:33, Mark 8:34-35, and Matthew 11:28-30</li> <li>Memorize <a href='https://www.biblegateway.com/passage/?search=John+10%3A10&version=ESV' target='_blank'>John 10:10</a></li> </ul> </li> <li><span class='bold'>Friday:</span> <ul> <li>Review Matthew 6:33, Mark 8:34-35, Matthew 11:28-30, and John 10:10</li> <li>Memorize <a href='https://www.biblegateway.com/passage/?search=Matthew+28%3A18-20&version=ESV' target='_blank'>Matthew 28:18-20</a></li> </ul> </li></ul><p><span class='bold'>Tips for memorization</span></p><ul> <li>Read it aloud repeatedly.</li> <li>Write it out on a piece of paper and then memorize it in sections, covering up one section at a time until you have the whole thing down, or keep writing it out until you no longer have to look at the Bible.</li> <li>Consider downloading the Fighter Verses App or the Scripture Typer App which are designed to help you memorize scripture and keep track of the verses you have memorized.</li> <li>Write the verse on index cards and place them around your house.</li> <li>Write out what the verse means and how this truth will impact your daily life. The more it means to you, the easier it will be to memorize, and the more you memorize it, the more it will mean to you.</li> <li>Incorporate the verse into your prayers.</li></ul>",
        "startDate": "2017-03-20",
        "endDate": null
    },
    {
        "week": 3,
        "theme": "Confession",
        "description": "<h1>Week 3: Confession</h1><div class='[ text-bigger bold ]'>What is confession?</div><p>Confession is admitting your sins to God and seeking his forgiveness in an effort to renew and restore your relationship with God.</p><div class='[ text-bigger bold ]'>Why confess?</div><p>God takes our sin very seriously. So seriously, in fact, that Jesus had to die. Because of Jesus, you will never be more loved by God than you are right now, but your sin still offends him. When you sin against your spouse, it does not end your marriage, but it does injure your relationship until you seek forgiveness. It&rsquo;s the same with God. Our sin by no means terminates our relationship with God, but it injures it. 1 John 1:9 says, &ldquo;If we confess our sins, he is faithful and just to forgive us our sins and to cleanse us from all unrighteousness.&rdquo; When we confess, we get God&rsquo;s forgiveness which becomes the healing balm for our souls. Confession should be a normal rhythm of life for the believer because we are well aware of just how prone we are to daily sin</p><div class='[ text-bigger bold ]'>How will this work?</div><ol> <li><span class='bold'>Reflect on what needs to be confessed:</span> Read Psalm 139:23-24 and pray it as a prayer to God. Then think about the ways that you have sinned against him and others. Just because you haven&rsquo;t committed murder or adultery doesn&rsquo;t mean you are free and clear. Think about the ways you put yourself before God. Think about how you have treated others or even the thoughts you have had about others that may be sinful.</li> <li><span class='bold'>Admit your sins to God:</span> Grab and journal and a pen and write a paragraph to God admitting the sins that came to mind. Consider kneeling as you confess because it&rsquo;s a posture of humility.</li> <li><span class='bold'>Seek forgiveness:</span> You can ask for forgiveness in your own words or consider one of these other options each day. <ul> <li><span class='bold'>Monday:</span> Read <a href='https://www.biblegateway.com/passage/?search=Psalm+51%3A1-17&version=ESV' target='_blank'>Psalm 51:1-17</a>: Pray this Psalm as your own prayer of confession to God. If it&rsquo;s helpful, insert your own name into the Psalm to personalize it.</li> <li><span class='bold'>Tuesday:</span> Say this prayer of confession from The Worship Sourcebook: <ul> <li>God of love, in the wrong we have done<br />and in the good we have not done,<br />we have sinned in ignorance;<br />we have sinned in weakness;<br />we have sinned through our own deliberate fault.<br />We are truly sorry.<br />We repent and turn to you.<br />Forgive us and renew our lives<br />through Jesus Christ, our Lord. Amen.</li> </ul> </li> <li><span class='bold'>Wednesday:</span> Read <a href='https://www.biblegateway.com/passage/?search=Psalm+130&version=ESV' target='_blank'>Psalm 130</a>: Pray this Psalm as your own prayer of confession to God. If it&rsquo;s helpful, insert your own name into the Psalm to personalize it.</li> <li><span class='bold'>Thursday:</span> Say this prayer of confession from The Worship Sourcebook: <ul> <li>Merciful God, for the things we have done that we regret, forgive us;<br />for the things we have failed to do that we regret, forgive us;<br />for all the times we have acted without love, forgive us;<br />for all the times we have reacted without thought, forgive us;<br />for all the times we have withdrawn care, forgive us;<br />for all the times we have failed to forgive, forgive us.<br />For hurtful words said and helpful words unsaid,<br />For unfinished tasks and unfulfilled hopes, God of all time, forgives us and help us to lay down our burden of regret. Amen.</li> </ul> </li> <li><span class='bold'>Friday:</span> Read <a href='https://www.biblegateway.com/passage/?search=Psalm+32&version=ESV' target='_blank'>Psalm 32</a>: Pray this Psalm as your own prayer of confession to God. If it&rsquo;s helpful, insert your own name into the Psalm to personalize it.</li> </ul> </li> <li><span class='bold'>Thank God for his forgiveness and turn from your sin:</span> Take a couple moments to say thank you to God for his grace, and ask him to give you the strength to turn from your sins.</li></ol>",
        "startDate": "2017-03-27",
        "endDate": null
    },
    {
        "week": 4,
        "theme": "Private Worship",
        "description": "<h1>Week 4: Fasting</h1><div class='[ text-bigger bold ]'>What is it?</div><p>Fasting is the giving up of food, or another pleasure or thing we love (like TV, social media, etc), for a set period of time and specific spiritual purpose.<br />There are two-parts to our fasting:</p><ol> <li>We remove food or something else to decrease our love and dependence on it.</li> <li>We replace it with a deeper love for and reliance on Christ and for others to know him.</li></ol><div class='[ text-bigger bold ]'>Why fast?</div><p>When you read about the early church in Acts, fasting was a normal rhythm in the lives of the Christians. We read in Acts 13:2 &ldquo;While they were worshipping the Lord and fasting, the Holy Spirit said, &lsquo;set apart for me Barnabas and Saul for the work to which I have called him.&rsquo;&rdquo; The church sent Barnabas and Saul out as missionaries to share the good news about Jesus. Fasting played an important role in aligning the church and their prayers with that mission. Our hope is for fasting to have the same impact on you and our church.</p><p>The story of Barnabas and Saul (who is Paul) is a great one, as they had an enormous impact in helping people come to know Jesus. Through our time of prayer and fasting, we hope the same thing happens here, especially on Easter weekend.</p><div class='[ text-bigger bold ]'>How will this work?</div><ol> <li>Decide if you are going to do a food fast or something else (like social media, TV, etc).</li> <li>Observe the fast Thursday from 7:10 a.m. &ndash; 7:10 p.m. and other days if desired.</li> <li>During the fast: <ul> <li>Spend your meal times to realign your prayer times for people to come to know Jesus. Pray for those coming on Easter Weekend and the people&rsquo;s names on the floor of the church. Be led by <a href='https://www.biblegateway.com/passage/?search=Matthew+6%3A5-15&version=ESV' target='_blank'>Matthew 6:5-15</a> and <a href='https://www.biblegateway.com/passage/?search=1+Timothy+2%3A1-7&version=ESV' target='_blank'>1 Timothy 2:1-7</a> in your prayer time.</li> <li>When you are getting uncomfortable, read God&rsquo;s Word. During a fast we feast on God&rsquo;s Word. Be nourished by passages like <a href='https://www.biblegateway.com/passage/?search=Matthew+4%3A1-11&version=ESV' target='_blank'>Matthew 4:1-11</a> and <a href='https://www.biblegateway.com/passage/?search=Ephesians+1%3A1-14&version=ESV' target='_blank'>Ephesians 1:1-14</a>.</li> </ul> </li> <li>Take extra caution to hide the impact of the fast on you, as you try not to draw attention to yourself in this time.</li></ol>",
        "startDate": "2017-04-03",
        "endDate": null
    },
    {
        "week": 5,
        "theme": "Fasting &amp; Prayer",
        "description": "",
        "startDate": "2017-04-10",
        "endDate": null
    }
]