[
    {
        "name": "Blessings",
        "website": "http://blessingsspc.com",
        "description": "Blessings provides financial assistance to young, single, pregnant women for daycare and scholastic accountability so they can graduate from high school. They are connected with a Christian mentor and participate in life skills and parenting classes and are required to attend a Christ-centered church weekly.",
        "options": [
            {
                "name": "Graduation",
                "details": "Attend the annual graduation ceremony and celebration for the girls who have completed their high school degree. Details available in February."
            },
            {
                "name": "Annual Walk/Bike Event",
                "details": "Walk or bike to support Blessings at their annual fundraiser at Stow-Munroe Falls High School Sat., May 13 from 10 a.m. &ndash; noon. More details available in April."
            }
        ]
    },
    {
        "name": "Broken Chains",
        "website": "",
        "description": "Broken Chains Ministry is a faith-based, non-profit headquartered in the Summit County Jail in Akron. The mission is to engage former offenders for the purpose of reintegration back into the community, thereby lowering recidivism rates in Akron and increasing public safety. Introducing these former offenders to Jesus Christ is the primary and most important thing this ministry works to accomplish.",
        "options": [
            {
                "name": "Visit Urbean Café",
                "details": "631 S Broadway St., Metro Transit Center, Akron, OH 44311<br />Mon. – Fri. from 7 a.m. - 7 p.m. and Sat. from 9 a.m. - 3 p.m."
            },
            {
                "name": "Annual Bike for Mike Event",
                "details": "Details available in April."
            },
            {
                "name": "Urbean Café Open House",
                "details": "Sat., Mar. 4 at 10 a.m.<br />631 S Broadway St., Metro Transit Center, Akron, OH 44311 "
            }
        ]
    },
    {
        "name": "Faithful Servants",
        "website": "",
        "description": "Faithful Servants is a Christian-based health care organization committed to providing urgent care to the uninsured with an income below 200% of the Federal Poverty Level in the greater Akron area. Services are provided at no cost to the patient by professional, licensed physicians and clinicians who volunteer their time and talents to serve those in need.",
        "options": [
            {
                "name": "Volunteers&rsquo; Meal ",
                "details": "Prepare and deliver a ready-to-eat meal to our six-eight volunteer doctors and nurses before they being their shift, many of whom come straight from work to serve. To reserve an evening, email <a href='mailto:kbertolini@gmail.com'>Kathi</a>."
            },
            {
                "name": "Visit the Clinic",
                "details": "Check back here for dates and times available."
            }
        ]
    },
    {
        "name": "First Glance",
        "website": "",
        "description": "First Glance is a student center in the Kenmore community of Akron that is open most evenings of the week with the mission of connecting students to Christ and the church through real, loving and non-threating avenues.",
        "options": [
            {
                "name": "Visit the Skate Park",
                "details": "For those looking for a more adventurous opportunity, visit and use the indoor skate park at the First Glance Ministry Center.<br />943 Kenmore Blvd., Akron, OH 44314<br />Mondays, Tuesdays, Thursdays, Fridays 4-10 p.m.<br />$5 fee per person. Free on Tuesdays"
            },
            {
                "name": "Open House",
                "details": "Sun., March 19 from 12-2 p.m.<br />943 Kenmore Blvd. Akron, OH 44314"
            }
        ]
    },
    {
        "name": "Haven of Rest",
        "website": "http://havenofrest.org",
        "description": "Haven of Rest provides Christ-centered programs and services that respond to the physical, spiritual and emotional needs of homeless and poor men, women and children in the Akron area.",
        "options": [
            {
                "name": "Open House",
                "details": "Nov. 9 from 2-7 p.m.<br />175 E Market St, Akron, OH 44308"
            },
            {
                "name": "Clothes/Food",
                "details": "Drop off food and gently used clothing to the Client Services Center at Haven of Rest.<br />207 East Market Street, Akron, OH 44308"
            },
            {
                "name": "Work in the Kitchen",
                "details": "Email <a href='mailto:jpluck@havenofrest.org'>Jan Pluck</a>, volunteer coordinator at Haven of Rest, to sign up for a date to work in the kitchen and help feed the homeless of Akron."
            }
        ]
    },
    {
        "name": "Legacies of Success",
        "website": "",
        "description": "Legacies of Success (LOS) exists to revitalize the North Hill community by transforming the neighborhood one house at a time. LOS efforts are invested in improving the lives of the current residents and helping them to benefit from the improvements in the neighborhood. Changing the lives of the current residents and introducing them to Christ is the top priority.",
        "options": [
            {
                "name": "Home Rehab",
                "details": "Once the next home is purchased, opportunities to participate in the rehabilitation and restoration of the home will be posted."
            }
        ]
    },
    {
        "name": "Mobility Worldwide",
        "website": "",
        "description": "Mobility Worldwide is a faith-based, volunteer-driven non-profit that manufactures and distributes mobility carts so that recipients may &ldquo;in the name of Jesus Christ, arise and walk.&rdquo; (Acts 3:6)",
        "options": [
            {
                "name": "Production Facility Tour Drop-In",
                "details": "1445 Commerce Dr., Stow, OH 44224<br />Tue. - Thu. from 9:30 a.m. - 12 p.m. "
            },
            {
                "name": "Open House",
                "details": "Sun., May 21 from 12-4 p.m."
            }
        ]
    },
    {
        "name": "Pregnancy Solutions &amp; Services",
        "website": "",
        "description": "The Pregnancy Solutions and Services (PSS) ultra-sound van travels to shopping areas, clinics, inner-city and rural locations providing a safe, clean environment where a registered sonographer reveals the clients' options and ties them to the truth of the gospel. PSS is committed to training prospective parents how to care for their babies and provides items they will need for the child's physical needs.",
        "options": [
            {
                "name": "Tour Ministry Center",
                "details": "Mon. – Fri. from 9 a.m. to 4:30 p.m.<br />3136 Manchester Rd, Akron, OH 44319"
            },
            {
                "name": "Donate an Item",
                "details": "Provide needed items for Emma&rsquo;s closet: diapers of any size, baby clothing and toys for a child under age of two."
            },
            {
                "name": "Annual Walk/Bike Event",
                "details": "This event will be held at Christ Community Chapel this summer. Details available in April."
            }
        ]
    },
    {
        "name": "Rahab",
        "website": "http://rahab-ministries.org",
        "description": "Rahab is a non-profit Christian ministry of volunteers devoted to rescuing and restoring women who are trafficked into prostitution in Northeast Ohio.",
        "options": [
            {
                "name": "Visit Rahab House",
                "details": "Visit the Rahab House during weekly programming (varying hours, Mon. – Fri. between 10 a.m. - 5 p.m.). There's availability for two-four men, women and children each day. One week's notice requested. Email <a href='mailto:Leann.Embaugh@gmail.com'>Leann</a> to schedule your visit."
            },
            {
                "name": "Deliver a Donation",
                "details": "Make or collect and deliver food, clothing or personal hygiene items.<br />450 Matthews Street, Akron, Ohio 44306"
            },
            {
                "name": "Administrative Support",
                "details": "Help with administrative tasks in the Rahab office Mon. – Fri. from 9 a.m. - 5 p.m. for a two-hour time block. One week’s notice is requested. Email <a href='mailto:beth@rahab-ministries.org'>Beth</a> to schedule. "
            }
        ]
    },
    {
        "name": "South Street Ministries",
        "website": "",
        "description": "South Street Ministries was founded and modeled after the philosophies of the Christian Community Development Association (CCDA). The backbone of the CCDA's ministry philosophy is the three R's: relocation, racial reconciliation and redistribution. Work includes jail, youth, women's ministries, after-school programs, bike shops, an urban garden and other community outreaches.",
        "options": [
            {
                "name": "Visit Front Porch Cafe",
                "details": "798 Grant Street, Akron, OH 44311<br />Mon. – Fri. from 7 a.m. - 3 p.m."
            },
            {
                "name": "Annual Rails to Trails Event",
                "details": "Details available in April."
            }
        ]
    },
    {
        "name": "True North",
        "website": "http://truenorthministry.org",
        "description": "Every year, True North Ministry reaches more than 2,200 imprisoned youth with Christ-centered programming via 130 volunteer missionaries. The mission of this ministry, &ldquo;to liberate imprisoned youth,&rdquo; permeates all aspects of the organization and reflects the youth they serve.",
        "options": [
            {
                "name": "Visit the Farm",
                "details": "Visit six young men working on the farm Mon., Wed., Thu. and Fri. from 10 a.m. - 4 p.m. and bring them lunch. Email <a href='mailto:Dave@truenorthministry.org'>Dave</a> or call 330.896.2700 to plan your visit."
            },
            {
                "name": "Dusty Donkey Festival",
                "details": "Visit the farm and get to know True North's ministry opportunities one Saturday this fall. More details to come."
            }
        ]
    },
    {
        "name": "Truly Reaching You",
        "website": "http://trulyreachingyou.com",
        "description": "Truly Reaching You Ministries (TRY) is a relationship-based reentry organization that reaches out to men and women who have served their sentence and are returning to their communities. Through relationships, mentorships, training and education, TRY provides a healthy support system for those who have made the commitment to surrender their old lifestyle. Pointing the men and women to Christ is the number one priority for this ministry.",
        "options": [
            {
                "name": "Attend Open House",
                "details": "A spring open house is being planned that will include a tour of a few of the ministry homes used by the men and women in the reentry program. Details will be posted as they are available."
            },
            {
                "name": "Ministry Center Tour",
                "details": "To schedule your tour or ask a question, email <a href='mailto:sherrie@trulyreachingyou.com'>Sherrie</a>.<br />Mon., Wed., Thu. and Fri. from 9:30 a.m. - 3:30 pm.<br />587 Baird St, Akron, OH 44311"
            }
        ]
    },
    {
        "name": "Urban Vision",
        "website": "http://urbanvisionministry.org",
        "description": "Urban Vision reaches the North Akron Community by demonstrating the redemptive love of Jesus Christ through Christ-centered programs focusing on the needs of the people in their community by restoring lives one child and family at a time. ",
        "options": [
            {
                "name": "Attend a Class",
                "details": "Life Skills Class: Mondays from 3:30-4 p.m.<br />Jr. Achievement Class: Tuesdays from 3:30-4 p.m.<br /><br />Email <a href='mailto:regina@urbanvisionministry.org'>Regina</a> to let her know to you plan to attend at least 24 hours before these two classes. You will receive a quick tour of the ministry center 15 - 20 minutes before class."
            },
            {
                "name": "English as a Foreign Language (EFL) Class",
                "details": "Tuesdays and Thursdays from 6-8 p.m. Classes can accommodate five visitors where refugees learn English. Email <a href='mailto:bena.paisley@ccchapel.com'>Bena</a> to reserve a spot."
            },
            {
                "name": "Attend 20-Year Anniversary Celebration",
                "details": "Mon., Sep. 25 at Christ Community Chapel - Hudson Campus.<br />Details available soon."
            }
        ]
    },
    {
        "name": "Restoration Chapel",
        "website": "",
        "description": "Restoration Chapel is a ministry of Christ Community Chapel located at the Cuyahoga Hills Youth Detention Center. Weekly service includes worship, a message and time to interact with the young men who attend. 25-75 young men from the facility that houses 160 young men from the age of 12-18 attend weekly. We also hold bible studies, skills classes and participates in the weekly orientation intake process.",
        "options": [
            {
                "name": "Attend a Service",
                "details": "Men and women 18 and older are able to enter the facility as a guest. Email <a href='mailto:Richard.White@ccchapel.com'>Richard White</a> at least 24 hours in advance so he can obtain a gate pass.<br />Wednesdays from 6:30-8 p.m.<br />4321 Green Rd, Highland Hills, OH 44122"
            }
        ]
    },
    {
        "name": "Nursing Home Ministry",
        "website": "",
        "description": "Truly Reaching You Ministries (TRY) is a relationship-based reentry organization that reaches out to men and women who have served their sentence and are returning to their communities. Through relationships, mentorships, training and education, TRY provides a healthy support system for those who have made the commitment to surrender their old lifestyle. Pointing the men and women to Christ is the number one priority for this ministry.",
        "options": [
            {
                "name": "Portage Trail Village",
                "details": "45 Cathedral Lane<br />Cuyahoga Falls, OH 44223<br />First and third Monday<br />10:15-11:15 a.m."
            },
            {
                "name": "Gables of Hudson",
                "details": "5400 Darrow Rd.<br />Hudson, OH 44236<br />Second Friday<br />10:30-11:30 a.m."
            },
            {
                "name": "Heritage of Hudson",
                "details": "1212 W. Barlow Rd.<br />Hudson, OH 44236<br />Third Friday<br />10:30-11:30 a.m."
            },
            {
                "name": "Gardens of Western Reserve",
                "details": "9975 Greentree Parkway<br />Streetsboro, OH 44241<br />Third Sunday<br />2:30-3:30 p.m."
            }
        ]
    }
]