[
    {
        "name": "Blessings",
        "website": "http://blessingsspc.com",
        "contactEmail": "rfasnacht@gmail.com",
        "description": "Blessings provides financial assistance to young, single, pregnant women for daycare and scholastic accountability so they can graduate from high school. They are connected with a Christian mentor and participate in life skills and parenting classes and are required to attend a Christ-centered church weekly.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            
        ]
    },
    {
        "name": "Broken Chains",
        "website": "http://www.brokenchainsministry.org/",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "Broken Chains Ministry is a faith-based, non-profit headquartered in the Summit County Jail in Akron. The mission is to engage former offenders for the purpose of reintegration back into the community, thereby lowering recidivism rates in Akron and increasing public safety. Introducing these former offenders to Jesus Christ is the primary and most important thing this ministry works to accomplish.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Visit Urbean Café",
                "details": "Enjoy a meal at Urbean Café and support Broken Chains and their clients at the same time.<div class='italic'>Mon. &ndash; Fri. from 7 a.m. &ndash; 7 p.m.<br/>Sat. from 9 a.m. &ndash; 3 p.m.</div>631 S Broadway St., Metro Transit Center, Akron, OH 44311<br /><a href='https://www.youtube.com/watch?v=9ZWsupfCwKs'>Urbean Cafe Video</a>"
            },
            {
                "id": 1,
                "name": "Build a Fire Pit",
                "details": "Come out on Saturday, September 30th from 9:00 a.m. &ndash; 1:00 p.m. to build a fire pit at Lydia's Home, their new addiction recovery home for women. Interested parties can email <a href='mailto:dennis.shawhan@hotmail.com'>Dennis</a> or call 330.472.1166"
            },
            {
                "id": 2,
                "name": "Write Cards of Encouragement",
                "details": "Consider writing cards of encouragement to ladies at Lydia's Home. Email <a href='mailto:Tamela@brokenchainsministry.org'>Tamela</a> if you are interested."
            },
            {
                "id": 3,
                "name": "Artwork for Broken Hearts",
                "details": "Attend the <span class='italic'>Artwork for Broken Hearts</span> event at the newly renovated Block. Saturday, September 30th from 7-9 p.m. The art sale will feature pieces from our Door #2 ministry and will benefit Broken Chain’s new Lydia’s Home &ndash; a women’s recovery home for women suffering from opiate addiction."
            }
        ]
    },
    {
        "name": "Faithful Servants",
        "website": "http://faithfulservantscarecenter.org/",
        "contactEmail": "kbertolini@gmail.com",
        "description": "Faithful Servants is a Christian-based health care organization committed to providing urgent care to the uninsured with an income below 200% of the Federal Poverty Level in the greater Akron area. Services are provided at no cost to the patient by professional, licensed physicians and clinicians who volunteer their time and talents to serve those in need.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Clean the Clinic",
                "details": "Clean the medical clinic in Tallmadge the fourth Saturday of each month and tour the facility. For more details, email <a href='mailto:kbertolini@gmail.com'>Kathi</a>."
            },
            {
                "id": 1,                
                "name": "5K &amp; 1 Mile Fun Run/Walk",
                "details": "<div class='italic'>Mon., Sep. 4 at Faithful Servants Care Center</div>65 Community Road Tallmadge, OH  44278<br />This fund raising event will bless Faithful Servants in assisting individuals and families in our community who do not have access to medical care. This is a family friendly event that will be lots of fun for all involved. For more information, email <a href='mailto:kbertolini@gmail.com'>Kathi</a>."
            },
            {
                "id": 2,                
                "name": "5th Anniversary Gala & Auction",
                "details": "<div class='italic'>Sat., Sep. 16 at NEOMED</div>4209 OH-44, Rootstown, OH 44272<br /> Join us for our 5th annual gala & auction benefitting the Faithful Servants Care Center. If you would like to attend, please email <a href='mailto:FSCCBarb@gmail.com'>Barb</a> or call 330.633.3680."
            }
        ]
    },
    {
        "name": "First Glance",
        "website": "http://www.firstglance.org/",
        "contactEmail": "melnawn@gmail.com",
        "description": "First Glance is a student center in the Kenmore community of Akron that is open most evenings of the week with the mission of connecting students to Christ and the church through real, loving and non-threating avenues.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Visit the Skate Park",
                "details": "<div class='italic'>Mon., Tue., Thu. &amp; Fri. 4&ndash;10 p.m.</div>943 Kenmore Blvd., Akron, OH 44314<br />For those looking for a more adventurous opportunity, visit and use the indoor skate park at the First Glance Ministry Center.<br />$5 fee per person. Free on Tuesdays"
            },
            {
                "id": 2,
                "name": "Prayer Week",
                "details": "First Glance is partnering with several ministries (including Rahab) for a week long prayer event! Join us on Sun., Sep. 10 at 6:30 p.m. for a worship and prayer night at First Glance and continue praying with us until we meet again on Sun., Sep. 17 at 6:30 p.m. Feel free to just come to the worship nights or <a href='https://docs.google.com/spreadsheets/d/12UNBZyBmaU0wKcHGmZREXAJ5u7zsM8bEOyjdLr0DB_k/edit?usp=sharing' target='_blank'>sign up</a> for a 1 hour prayer shift during the week."
            },
            {
                "id": 3,
                "name": "Make &amp; Serve a Meal",
                "details": "Make a meal and help serve it on Mondays at 7 p.m. (for Young Adults) or Tuesdays at 6:30 p.m. (for Manu Up). Email <a href='mailto:jessica@firstglance.org'>Jessica</a> for more information and to sign up."
            }
        ]
    },
    {
        "name": "Haven of Rest",
        "website": "http://havenofrest.org",
        "contactEmail": "duncanothen@hotmail.com",
        "description": "Haven of Rest provides Christ-centered programs and services that respond to the physical, spiritual and emotional needs of homeless and poor men, women and children in the Akron area.",
        "options": [
            {
                "id": 0,
                "name": "Serve a Meal",
                "details": "207 East Market Street, Akron, OH 44308<br />Email <a href='mailto:jpluck@havenofrest.org'>Jan</a> to sign up for a date to work in the kitchen and help feed the homeless of Akron."
            },
            {
                "id": 1,                
                "name": "Collect Clothes/Food",
                "details": "207 East Market Street, Akron, OH 44308<br />Collect needed items and bring to Haven of Rest. Current needs are:  shampoo, deodorant, toothbrushes, toothpaste, canned fruit and vegetables, coffee and beverage mixes, men's tennis shoes and pants (especially waist sizes 28&rdquo; to 34&rdquo;), mens &amp; ladies undergarments, socks for infants and toddlers, twin bed sheets, bath towels and baby onesies. To arrange for a tour when you drop off your donation, email <a href='mailto:rrose@havenofrest.org'>Rose</a>."
            }
        ]
    },
    {
        "name": "Legacies of Success",
        "website": "http://legaciesofsuccess.org/home/",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "Legacies of Success (LOS) exists to revitalize the North Hill community by transforming the neighborhood one house at a time. LOS efforts are invested in improving the lives of the current residents and helping them to benefit from the improvements in the neighborhood. Changing the lives of the current residents and introducing them to Christ is the top priority.",
        "options": [
            {
                "id": 0,                
                "name": "Neighborhood Walk",
                "details": "<div class='italic'>Mon. &ndash; Fri. | 9 a.m. &ndash; 5 p.m. (by appointment)</div>Come walk the streets of North Hill with the executive director of Legacies of Success and learn more about what God is doing in North Hill. Individuals and groups are welcome. Email <a href='mailto:brendan@legaciesofsuccess.org'>Brendan</a> for details and to sign up."
            }
        ]
    },
    {
        "name": "Mobility Worldwide",
        "website": "http://www.mobilityohstow.org ",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "Mobility Worldwide is a faith-based, volunteer-driven non-profit that manufactures and distributes mobility carts so that recipients may &ldquo;in the name of Jesus Christ, arise and walk.&rdquo; (Acts 3:6).<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Production Facility Tour Drop-In",
                "details": "<div class='italic'>Tue. &ndash; Thu. from 9&ndash;11 a.m.</div>1445 Commerce Dr., Stow, OH 44224<br />Stop in and take a tour of the Mobility Worldwide facility and see the amazing work they are doing. This is a great spree opportunity for individuals, community groups or families!<br />Email <a href='leepetno@gmail.com'>Lee</a> for more information."
            }
        ]
    },
    {
        "name": "Pregnancy Solutions",
        "website": "http://www.pregsolutions.org/",
        "contactEmail": "kcistone6@gmail.com",
        "description": "Pregnancy Solutions & Servies (PSS) is a pregnancy medical center that seeks to empower and educate people in pregnancy-related decisions. Through the use of free pregnancy tests, ultrasounds and options counseling, they hold out truth with the hope to save babies from abortion and lead men and women to a relationship with Jesus. They have a center in Portage Lakes and a medical mobile unit that travels throughout the community.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Prayer Walk",
                "details": "<div class='italic'>Mon. &ndash; Fri. from 9 a.m. &ndash; 4:30 p.m.</div>3136 Manchester Rd, Akron, OH 44319<br />Prayer walk through the ministry center with a custom card that guides you through the ministry rooms and gives specific prayer needs. This is a great opportunity to see the center and have a big impact on their fight to save lives."
            },
            {
                "id": 1,                
                "name": "Renovate Emma’s Closet Boutique",
                "details": "Emma’s closet has not been remodeled since the ministry started and they would really love to have the room painted and new flooring installed. They have the funds for both the flooring and the paint so we just need a community group to come and do either project or both. Email <a href='mailto:barbara.ammirati@ccchapel.com '>Barbara</a> for details."
            }
        ]
    },
    {
        "name": "Rahab Ministries",
        "website": "http://rahab-ministries.org",
        "contactEmail": "Jacque481@aol.com",
        "description": "Rahab is a non-profit Christian ministry of volunteers devoted to rescuing and restoring women who are trafficked into prostitution in Northeast Ohio.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Open House for CCC",
                "details": "<div class='italic'>Mon., Oct. 16 from 6&ndash;8 p.m.</div>Join us for an opportunity to tour the drop-in house in Akron and learn what goes on every day. This is a casual, no-commitment opportunity to get a glimpse into Rahab at a time when clients aren't present. There will be an opportunity to ask questions and light refreshments will be served. Space is limited and we don't know when we will have this opportunity again. Individuals or small groups, please consider coming! Email <a href='mailto:beth@rahab-ministries.org'>Beth</a> for details and to sign up."
            },
            {
                "id": 1,                
                "name": "Gift Bags",
                "details": "Put together 20 gift bags (or more) for Rahab’s strip club outreach. Each bag could have a baked good (ex. cupcake, cookies, etc.), something encouraging (scripture), a small personal item (nail polish, journal), etc. Email <a href='mailto:barbara.ammirati@ccchapel.com'>Barbara</a> for more information."
            },
            {
                "id": 2,                
                "name": "Watch a Video",
                "details": "<a href='https://vimeo.com/207499874' target='_blank'>Watch the new video</a> from Rahab &ldquo;Top 10 Things Not to Do When Interacting with the Women of Rahab.&rdquo;"
            }
        ]
    },
    {
        "name": "South Street Ministries",
        "website": "http://southstreetministries.org/",
        "contactEmail": "bammons@cyberacc.com",
        "description": "South Street Ministries was founded and modeled after the philosophies of the Christian Community Development Association (CCDA). The backbone of the CCDA's ministry philosophy is the three R's: relocation, racial reconciliation and redistribution. Work includes jail, youth, women's ministries, after-school programs, bike shops, an urban garden and other community outreaches.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Visit Front Porch Caf&eacute;",
                "details": "<div class='italic'>Mon. &ndash; Fri. from 7 a.m. &ndash; 3 p.m.</div>798 Grant Street, Akron, OH 44311"
            },
            {
                "id": 1,                
                "name": "Make a Meal",
                "details": "Provide a meal for 8-10 doctors and nurses volunteering at the Faithful Servants medical clinic site every Wed. at the Front Porch. Email <a href='mailto:josephjtucker@gmail.com'>Joe</a> for more information."
            },
            {
                "id": 2,                
                "name": "Annual Trails N Rails Event",
                "details": "<div class='italic'>Sep. 30 from 8 a.m. &ndash; 1 p.m.</div>Join us for South Street’s annual Trails N Rails event. Visit <a href='http://southstreetministries.org/trails-n-rails/' target='_blank'>southstreetministries.org</a> for more information."
            }
        ]
    },
    {
        "name": "True North Ministry",
        "website": "http://truenorthministry.org",
        "contactEmail": "duncanothen@hotmail.com",
        "description": "Every year, True North Ministry reaches more than 2,200 imprisoned youth with Christ-centered programming via 130 volunteer missionaries. The mission of this ministry, &ldquo;to liberate imprisoned youth,&rdquo; permeates all aspects of the organization and reflects the youth they serve.",
        "options": [
            {
                "id": 0,                
                "name": "Lead a Bible Study",
                "details": "We need some new volunteers for the True North bible studies at the Dan Street Juvenile Detention Center in Akron. We go there once a month on the fourth Sunday. The bible studies are from 9-10 a.m., leaving plenty of time to get to the third service on those days. For more information, email <a href='mailto:duncanothen@hotmail.com'>Duncan</a>."
            },
            {
                "id": 1,                
                "name": "Visit the Farm",
                "details": "<div class='italic'>Mon., Wed., Thu. &amp; Fri. from 10 a.m. &ndash; 4 p.m.</div>Visit six young men working on the farm and bring them lunch. Email <a href='mailto:Dave@truenorthministry.org'>Dave</a> or call 330.896.2700 to plan your visit."
            },
            {
                "id": 2,                
                "name": "Become a Trained Volunteer",
                "details": "Want to be trained to volunteer with True North and work with incarcerated youth? Email <a href='mailto:duncanothen@hotmail.com'>Duncan</a> for details. He can come to your community group or meet you at the church for training, and it takes less than an hour."
            }
        ]
    },
    {
        "name": "Truly Reaching You",
        "website": "http://trulyreachingyou.com",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "Truly Reaching You Ministries (TRY) is a relationship-based reentry organization that reaches out to men and women who have served their sentence and are returning to their communities. Through relationships, mentorships, training and education, TRY provides a healthy support system for those who have made the commitment to surrender their old lifestyle. Pointing the men and women to Christ is the number one priority for this ministry.<br /><br /><div class='italic'>We hope you will jump in and participate with this ministry to learn more about it and the people they serve. Just as we encourage new members to know and trust our church before they give financially, please do not feel any obligation to give to this ministry until you learn more and feel the Holy Spirit leading you to do so.</div>",
        "options": [
            {
                "id": 0,                
                "name": "Paint the Office",
                "details": "Come paint TRY Ministries’ inner office area. CCC has funds to purchase the painting materials. Email <a href='mailto:Barbara.ammirati@ccchapel.com'>Barbara</a> for details."
            },
            {
                "id": 1,                
                "name": "Renovation Projects",
                "details": "One last renovation project is available for groups. (Thanks so much to the groups who have be finished the other 2 projects. This has been a huge blessing for this ministry!) Email <a href='mailto:hallie.andrews@ccchapel.com'>Hallie</a> for details."
            }
        ]
    },
    {
        "name": "Urban Vision",
        "website": "http://urbanvisionministry.org",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "Urban Vision reaches the North Akron Community by demonstrating the redemptive love of Jesus Christ through Christ-centered programs focusing on the needs of the people in their community by restoring lives one child and family at a time. ",
        "options": [
            {
                "id": 0,                
                "name": "Make Sandwiches",
                "details": "Life Skills Class: Mon. from 3:30-4 p.m.<br />Jr. Achievement Class: Tue. from 3:30-4 p.m.<br /><br />Email <a href='mailto:regina@urbanvisionministry.org'>Regina</a> to let her know to you plan to attend at least 24 hours before these two classes. You will receive a quick tour of the ministry center 15 &ndash; 20 minutes before class."
            },
            {
                "id": 1,                
                "name": "Attend 25-Year Anniversary Celebration",
                "details": "Purchase, prepare and wrap 200 lunch meat and cheese sandwiches for one or both of Urban Vision’s Kids Club days (Sep. 15 &amp; Sep. 22).  Email <a href='mailto:Regina@urbanvisionministry.org'>Regina</a> for more information or to reserve a date.<div class='italic'>(Please individually wrap the sandwiches and do not put any condiments on them.)</div>"
            }
        ]
    },
    {
        "name": "Restoration Chapel",
        "contactEmail": "Richard.White@ccchapel.com",
        "description": "Restoration Chapel is a ministry of Christ Community Chapel located at the Cuyahoga Hills Youth Detention Center. Weekly service includes worship, a message and time to interact with the young men who attend. 25-75 young men from the facility that houses 160 young men from the age of 12-18 attend weekly. We also hold bible studies, skills classes and participate in the weekly orientation intake process.",
        "options": [
            {
                "id": 0,                
                "name": "Attend a Service",
                "details": "<div class='italic'>Wed. from 6-9 p.m.</div>4321 Green Rd, Highland Hills, OH 44122<br />Men and women 18 and older are able to enter the facility as a guest.<br />If you’re entire Community Group would like to attend together, we can provide transportation from the Hudson campus along with a boxed dinner from Chick-Fil-A for you to enjoy on the drive.<br />Email <a href='mailto:barbara.ammirati@ccchapel.com'>Barbara</a> to sign-up."
            }
        ]
    },
    {
        "name": "Nursing Home Ministry",
        "contactEmail": "Richard.White@ccchapel.com",
        "description": "We view the nursing homes listed below as venues of Christ Community Chapel. Volunteers lead a full worship service at each location to take authentic worship to those who are unable to get out and attend at one of our campuses. Your company is greatly appreciated by those attending and those who are leading the weekly services!",
        "options": [
            {
                "id": 0,                
                "name": "Portage Trail Village",
                "details": "<div class='italic'>1st &amp; 3rd Monday from 10:15-11:15 a.m.</div>45 Cathedral Lane<br />Cuyahoga Falls, OH 44223<br />"
            },
            {
                "id": 1,                
                "name": "Gables of Hudson",
                "details": "<div class='italic'>2nd Friday from 10:30-11:30 a.m.</div>5400 Darrow Rd.<br />Hudson, OH 44236"
            },
            {
                "id": 2,                
                "name": "Heritage of Hudson",
                "details": "<div class='italic'>3rd Friday from 10:30-11:30 a.m.</div>1212 Barlow Rd.<br />Hudson, OH 44236"
            },
            {
                "id": 3,                
                "name": "Gardens of Western Reserve",
                "details": "<div class='italic'>3rd Sunday from 2:30-3:30 p.m.</div>9975 Greentree Parkway<br />Streetsboro, OH 44241"
            },
            {
                "id": 4,
                "name": "Anna Maria of Aurora",
                "details": "889 N. Aurora Road<br />Aurora, OH 44202<br />Email <a href='mailto:marycourtney1@me.com'>Mary</a> for info about Bible studies, services and opportunities to serve."
            }
        ]
    },
    {
        "name": "Wild Card Option",
        "contactEmail": "Barbara.Ammirati@ccchapel.com",
        "description": "As a wild card option, you can choose a second opportunity at a ministry and count it as one of your eight activities. For example, you can visit the ministry center at PSS and then participate in the bike-a-thon.  Or you could visit the Front Porch Café and then return with your community group to do a project at the Front Porch at South Street as a wild card activity.",
        "options": [
            {
                "id": 0,                
                "name": "Homemade Cookies",
                "details": "We have some freezer bags that have hand written bible verses on them. We would love a community group or family to fill the bags with homemade cookies and then deliver them to one of our local outreach ministry partners. It would be such a great way for the kids to bless a ministry and also love on those who work so hard each day serving the Lord in the city! Email <a href='mailto:barbara.ammirati@ccchapel.com'>Barbara</a> for mroe information and to pick up the bags."
            }
        ]
    }
]